unit Materials;

interface
const marka:array[1..50] of string = ('12ХН2 ГОСТ 4543-71',
'12ХН3А ГОСТ 4543-71',
'12Х2Н4А ГОСТ 4543-71',
'15ХГНТА ГОСТ 4543-71',
'18ХГТ ГОСТ 4543-71',
'18ХГТ ГОСТ 4543-71' ,
'18Х2Н4ВА ГОСТ 4543-71',
'18Х2Н4ВА ГОСТ 4543-71',
'20Х ГОСТ 4543-71',
'20ХН ГОСТ 4543-71',
'20ХН2М ГОСТ 4543-71'   ,
'20ХН3А ГОСТ 4543-71'   ,
'20ХН3А ГОСТ 4543-71'   ,
'20Х2Н4А ГОСТ 4543-71'  ,
'20Х2Н4А ГОСТ 4543-71'  ,
'20ХГР ГОСТ 4543-71'    ,
'25ХГТМА ГОСТ 4543-71' ,
'30ХГТ ГОСТ 4543-71'    ,
'30ХГТ ГОСТ 4543-71 '   ,
'25ХГМ ГОСТ 4543-71'    ,
'25ХГТ ГОСТ 4543-71'    ,
'30ХГТ ГОСТ 4543-71'    ,
'35ХМ ГОСТ 4543-71'     ,
'35ХМ ГОСТ 4543-71'     ,
'40 ГОСТ 1050-74'       ,
'40 ГОСТ 1050-74'       ,
'40Х ГОСТ 4543-71'      ,
'40Х ГОСТ 4543-71'      ,
'40Х ГОСТ 4543-71'      ,
'40Х ГОСТ 4543-71'      ,
'40Х ГОСТ 4543-71'      ,
'40Х ГОСТ 4543-71'      ,
'40ХН ГОСТ 4543-71'     ,
'40ХН ГОСТ 4543-71'     ,
'40ХН ГОСТ 4543-71'     ,
'40ХН ГОСТ 4543-71 '    ,
'40ХН ГОСТ 4543-71'     ,
'40ХН ГОСТ 4543-71 '    ,
'40ХФА ГОСТ 4543-71'    ,
'40ХФА ГОСТ 4543-71'   ,
'40ХФА ГОСТ 4543-71'   ,
'40ХФА ГОСТ 4543-71'   ,
'40ХН2МА ГОСТ 4543-71' ,
'40ХН2МА ГОСТ 4543-71'  ,
'40ХН2МА ГОСТ 4543-71'  ,
'40ХН2МА ГОСТ 4543-71 ' ,
'40ХН2МА ГОСТ 4543-71'  ,
'45 ГОСТ 1050-74'      ,
'45 ГОСТ 1050-74'       ,
'50ХН ГОСТ 1050-74 ');

const Sigma_ta :array[1..50] of Integer =
(600,800,850,750,800,800,750,800,630,630,800,760,700,750,750,
900,1100,1100,1200,800,1000,1200,1100,1000,400,340,650,330,1100,1100,
1100,1100,650,460,1100,1100,1000,1000,650,460,1100,1100,700,650,1300,
1000,920,450,360,1100);

const Sigma_Flim0a :array[1..50] of Integer =
(950,950,820,950,820,680,820,780,820,950,950,950,780,820,780,
820,820,820,680,1000,750,750,580,480,420,330,500,330,580,460,
580,480,420,330,580,500,680,580,420,330,580,460,420,330,580,
680,580,240,330,500);

const Sigma_Fst0a :array[1..50] of Integer =
(2800,2800,2800,2800,2000,2000,2800,2800,2000,2800,2800,2800,2800,2800,2800,
2000,2000,2000,2000,2500,2200,2200,1800,2250,1500,1200,1800,1200,2250,2250,
1800,2250,1500,1200,2250,2250,1800,2250,1500,1200,2250,2250,1500,1200,2500,
2200,2500,1500,1200,2250);

const S_Fa :array[1..50] of Extended =
(1.55,1.55,1.55,1.55,1.55,1.70,1.55,1.70,1.55,1.55,1.55,1.55,1.70,1.55,1.70,
1.55,1.55,1.55,1.70,1.55,1.55,1.55,1.70,1.70,1.70,1.70,1.70,1.70,1.70,1.70,
1.70,1.70,1.70,1.70,1.70,1.70,1.70,1.70,1.70,1.70,1.70,1.70,1.70,1.70,1.70,
1.70,1.70,1.70,1.70,1.70);

   // Максимально допустимое значение мощности на ведущем валу, кВт
  P1Max: extended = 300;
  // Минимально допустимое значение мощности на ведущем валу, кВт
  P1Min: extended = 0.2;
  // Максимально допустимое значение передаточного числа
  UMax: extended = 8;
  // Минимально допустимое значение передаточного числа
  UMin: extended = 1;
  // Максимально допустимое значение частоты вращения ведущего шкива, об/мин
  N1Max: extended = 5000;
  // Минимально допустимое значение частоты вращения ведущего шкива, об/мин
  N1Min: extended = 1;
  // Расчетный ресурс передачи
  LhMax: real = 100000;
  LhMin: real = 10;
  // Твердость боковой поверхности витков червяка
  H_HRcp1max: real = 68;
  H_HRcp1min: real = 35;
  // Предел прочностм материала червячного колеса
  Sigma_B2max: real = 2000;
  Sigma_B2min: real = 100;

  Sigma_t2Max: real = 2000;
  Sigma_t2Min: real = 100;

  H_Hbp1max: real = 350;
  H_Hbp1min: real = 0;
implementation

end.
